blog/2017/11/19/diy-baby-monitor/index.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <title>DIY Baby Monitor - Aaron Kuehler</title>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="author" content="Aaron Kuehler" />
    <meta name="description" content="Project log detailing the build of a Baby Monitor with a Raspberry Pi" />
    <meta name="keywords" content="raspberry pi, baby monitor, diy" />
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Zilla+Slab&display=swap" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Zilla+Slab&display=swap"></noscript>
    <link rel="stylesheet" href="/media/css/main.css" type="text/css" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="/media/css/main.css" type="text/css"></noscript>
    <link rel="stylesheet" href="/media/css/prettify.css" type="text/css" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="/media/css/prettify.css" type="text/css"></noscript>
  </head>

  <body>
    <a href="#main">skip to main content</a>
<header role="banner" class="masthead navigation">
  <div class="navigation-wrapper">
    <h1>Aaron Kuehler</h1>
    <p><span class="visually-hidden">Subtitle: </span>80% Scientist, 20% Artist. Theorist and Practitioner.</p>
    <nav role="navigation" aria-label="contents">
      <ul class="navigation-menu show">
        <li><a href="/">Home</a></li>
          <li class="nav-link"><a href="/blog/">Blog</a></li>
        <li><a href="/tags/">Tags</a></li>
        <li><a href="https://github.com/indiebrain">GitHub</a></li>
        <li><a href="/rss.xml">RSS</a></li>
      </ul>
    </nav>
  </div>
</header>

    <main id="main">
<div>
<div class="post">
<h1>DIY Baby Monitor</h1>

<div id="outline-container-org695d213" class="outline-2">
<h2 id="org695d213">Motivation</h2>
<div class="outline-text-2" id="text-org695d213">
<p>
"Daddy, you have to stop talking to me through the camera at night" is the phrase which immediately preceded the hurried unplugging and dismantling of the Foscam FI8910W in the children's room. For you see, I had never used the two-way audio functionality of the device. It's a hard pill to swallow, you're supposed to be their protector but you've potentially invited the faceless stranger into their bedroom. Such was my experience. We, like many parents looking to avoid an outrageously priced video baby monitor, purchased the Foscam IP night-vision camera to remotely keep an eye our child at night, and at nap time. We locked the thing down, allowing LAN connections to the video/audio stream. It's hard to say for sure if an outside party actually gained access to the Foscam device, but the question alone is enough to make any parent yank the device from the wall and put it in a sound and light proof hole in the ground. After all, <a href="https://krebsonsecurity.com/2014/01/bug-exposes-ip-cameras-baby-monitors/">security issues with IP cameras and WI-FI baby monitors</a> are documented. So what's a parent to do?
</p>

<p>
This is a project log detailing how I built a less-creepy baby monitor for about the cost of a cheap IP camera.
</p>
</div>
</div>

<div id="outline-container-org2637eda" class="outline-2">
<h2 id="org2637eda">Parts list</h2>
<div class="outline-text-2" id="text-org2637eda">
<ul class="org-ul">
<li><a href="https://www.amazon.com/gp/product/B01C6Q2GSY/ref%3Doh_aui_search_detailpage?ie%3DUTF8&amp;psc%3D1">Raspberry Pi 3 Model B</a></li>
<li><a href="https://www.adafruit.com/product/3100">Pi Noir Infrared Camera Module</a></li>
<li><a href="https://www.amazon.com/gp/product/B00QM3KI7E/ref%3Doh_aui_search_detailpage?ie%3DUTF8&amp;psc%3D1">850nm Infrared Illuminator</a></li>
</ul>
</div>
</div>

<div id="outline-container-org41091af" class="outline-2">
<h2 id="org41091af">The Build</h2>
<div class="outline-text-2" id="text-org41091af">
<p>
FWIW, here's the kernel version I'm working with:
</p>

<div class="org-src-container">
<pre class="src src-sh">pi@raspberrypi:~ $ uname -a
Linux raspberrypi 4.9.41-v7+ #1023 SMP Tue Aug 8 16:00:15 BST 2017 armv7l GNU/Linux
</pre>
</div>
</div>

<div id="outline-container-org61e7adf" class="outline-3">
<h3 id="org61e7adf">Connect the Pi Noir</h3>
<div class="outline-text-3" id="text-org61e7adf">
<p>
<a href="https://www.youtube.com/embed/GImeVqHQzsE?rel=0">James Adams of the Raspberry Pi Foundation has a great walkthrough of how to get up and running with the camera modules</a>.
</p>
</div>
</div>

<div id="outline-container-org41749d8" class="outline-3">
<h3 id="org41749d8">Enable the Camera</h3>
<div class="outline-text-3" id="text-org41749d8">
<p>
Enable the pi camera port by loading the kernel modules. There are two potential ways to do this.
</p>

<p>
First, one can use the <code>sudo raspi-config</code> tool.
</p>


<p>
Second, one can manually load the camera kernel modules with <code>modprobe</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org2ca2087">sudo modprobe bcm2835-v4l2
</pre>
</div>

<p>
or, probably more helpfully, load the module at system boot by adding the following to <code>/etc/modules</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org586de53">...
bcm2835-v4l2
</pre>
</div>
</div>
</div>

<div id="outline-container-org639999f" class="outline-3">
<h3 id="org639999f">Setup the Infrared Illuminator (LED Array)</h3>
<div class="outline-text-3" id="text-org639999f">
<p>
This is the simplest step of the setup, we simply plug in our Infrared
LED array and position it in the room so that the viewing area of the
Pi Noir is saturated with IR light - that's it, no fuss no mess. This
enables the Pi Noir to continue to report useful images even in the
dark.
</p>

<p>
An added bonus, the <a href="https://www.amazon.com/gp/product/B00QM3KI7E/ref%3Doh_aui_search_detailpage?ie%3DUTF8&amp;psc%3D1">850nm Infrared Illuminator</a> used in this project
has an ambient light sensor which automatically shuts off the IR LED
array when the room is sufficiently light by another source.
</p>
</div>
</div>

<div id="outline-container-org2792118" class="outline-3">
<h3 id="org2792118">Install the <code>motion</code> package</h3>
<div class="outline-text-3" id="text-org2792118">
<div class="org-src-container">
<pre class="src src-sh">sudo apt update
sudo apt install motion
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ea22cf" class="outline-3">
<h3 id="org4ea22cf">Configure motion</h3>
<div class="outline-text-3" id="text-org4ea22cf">
<p>
We want motion to run as a background daemon on startup; installing motion with apt should setup the service for us, but it's worth checking the configuration to ensure that motion thinks it's going to start in daemon mode.
</p>

<div class="org-src-container">
<pre class="src src-conf"># Start in daemon (background) mode and release terminal (default: off)
daemon on
</pre>
</div>

<p>
With the camera modules loaded and the pi camera connected to the board, the device should be available at <code>/dev/video0</code>. We want to tell motion use the pi camera at <code>/dev/video0</code>:
</p>

<div class="org-src-container">
<pre class="src src-conf">  # Videodevice to be used for capturing  (default /dev/video0)
  # for FreeBSD default is /dev/bktr0
  videodevice /dev/video0
</pre>
</div>

<p>
The dimensions of the captured images can be manipulated as well. Here I use a small, but reasonable size as to not flood the pi's file system with large images.
</p>

<div class="org-src-container">
<pre class="src src-conf">  # Image width (pixels). Valid range: Camera dependent, default: 352
  width 640

  # Image height (pixels). Valid range: Camera dependent, default: 288
  height 480
</pre>
</div>

<p>
Next set the frame-rate of the captured video. I set mine to 24 frames-per-second. It provides a fairly fluid sense of motion and the pi seems to keep up pretty well with it.
</p>

<div class="org-src-container">
<pre class="src src-conf">  # Maximum number of frames to be captured per second.
  # Valid range: 2-100. Default: 100 (almost no limit).
  framerate 24
</pre>
</div>

<p>
Allow LAN connections to the video stream.
</p>

<div class="org-src-container">
<pre class="src src-conf">  # Restrict stream connections to localhost only (default: on)
  stream_localhost off
</pre>
</div>

<p>
Disable the capture and storage of still images and video from the camera.
</p>

<div class="org-src-container">
<pre class="src src-conf">  # Output 'normal' pictures when motion is detected (default: on)
  # Valid values: on, off, first, best, center
  # When set to 'first', only the first picture of an event is saved.
  # Picture with most motion of an event is saved when set to 'best'.
  # Picture with motion nearest center of picture is saved when set to 'center'.
  # Can be used as preview shot for the corresponding movie.
  output_pictures off


  # Use ffmpeg to encode movies in realtime (default: off)
  ffmpeg_output_movies off
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga23011f" class="outline-2">
<h2 id="orga23011f">Conclusion</h2>
<div class="outline-text-2" id="text-orga23011f">
<p>
Now that everything's setup and configured you can access the video stream at <code>http://&lt;your-raspberry-pi-host&gt;:8081</code> via any device on the local network. At about the same monetary and time commitment, this project provides more granular control, transparent security and privacy controls, and a clearer path to software/firmware updates than any Foscam solution - and 100% less baked in 3rd party eavesdropping.
</p>
</div>
</div>

</div>
</div>
    <div>
      <div class="post-meta">
        <div class="post-publication-info">
          <span title="post date" class="post-info">2017-11-19</span>
          <span title="author" class="post-info">Aaron Kuehler</span>
        </div>
        <div class="post-tags">
          <span title="tags" class="post-info"><a href="/tags/hardware/">hardware</a>, <a href="/tags/raspberry-pi/">raspberry pi</a></span>
        </div>
      </div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="/media/js/main.js"></script>
      <div class="footer">
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> Aaron Kuehler
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

    </main>
  </body>
</html>
